[
  {
    "id": "0",
    "owner": "Ali",
    "note": "Apply for NOC Silicon Valley to intern in a tech startup. You'll learn loads with the right attitude. Don’t worry if you \"didn't start a business\" or \"don't have entrepreneurship experience\". They love CS students.",
    "date": "2021-05-01 10:10"
  },
  {
    "id": "1",
    "owner": "Adhiraj",
    "note": "Computer Science is not about programming, though they go hand in hand.",
    "date": "2021-05-01 10:10"
  },
  {
    "id": "2",
    "owner": "Ced",
    "note": "Don't be afraid. http://metacog.tumblr.com/post/15889275145/fear-of-programming-stupidity",
    "date": "2021-05-01 10:10"
  },
  {
    "id": "3",
    "owner": "Div",
    "note": "You’re probably not learning as much as you should be",
    "date": "2021-05-01 10:10"
  },
  {
    "id": "4",
    "owner": "Wen Bin",
    "note": "join CCAs, don’t just mug. CAP is not everything.",
    "date": "2021-05-01 10:10"
  },
  {
    "id": "5",
    "owner": "Vaarnan",
    "note": "Be language agnostic. Learn how to self-learn. Also, the curriculum is made for everyone to follow. Learn beyond the course.",
    "date": "2021-05-01 10:10"
  },
  {
    "id": "6",
    "owner": "Frank",
    "note": "Experiment; it’s not expensive to experiment with computers.",
    "date": "2021-05-01 10:10"
  },
  {
    "id": "7",
    "owner": "Laurence",
    "note": "Go out and meet people from industry",
    "date": "2021-05-01 10:10"
  },
  {
    "id": "8",
    "owner": "Jason",
    "note": "Be brave. Read, read and read. Read widely. Don’t just read about computer science stuff. (Derek Sivers, has a very good reading list) Learn at least a new language every year (Or learn 7 Languages in 7 Weeks). Make sure the language messes with the way you normally think about programming. Alan Perlis once said: \"A language that doesn't affect the way you think about programming, is not worth knowing\"",
    "date": "2021-05-01 10:10"
  },
  {
    "id": "9",
    "owner": "Andrew",
    "note": "Make stuff to make your life easier. This works in more ways than one.",
    "date": "2021-05-01 10:10"
  },
  {
    "id": "10",
    "owner": "Silin",
    "note": "don't be intimidated/overwhelmed if you find yourself among the really awesome programmers, especially if you're coming in without any background. do your best to keep up with the lectures, and learn to pick up skills/knowledge outside of school-taught content by doing your own reading",
    "date": "2021-05-01 10:10"
  }
]
